number = int(input("Введіть число будь яке чотирьохзначне число і я покажу з яких цифр воно складається. Чекаю: "))
if 1000 <= number <= 9999:
    print('дякую! Ваше число складається з наступних цифр')
    print(f'Цифра 1: {number//1000}')
    print(f'Цифра 2: {((number//100)%10)}')
    print(f'Цифра 3: {((number//10)%10)}')
    print(f"Цифра 4: {((number%10)%10)}")
elif not number == 0:
    print('дякую! Ваше число складається з наступних цифр')
    print(f'Цифра 1: {number // 1000}')
    print(f'Цифра 2: {((number // 100) % 10)}')
    print(f'Цифра 3: {((number // 10) % 10)}')
    print(f"Цифра 4: {((number % 10) % 10)}")
else:
    print("Перевірте корректність введення. Це повинно бути число, та обов'язково чотирьохзначне")